#### Terraform Plan 📝`dev`

<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/576c32ba-f7e7-4550-9e9e-900ebeb173cb/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "dev-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "dev-opella-rg"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "OpellaDevOpsChallenge"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCm64OpBQgES5jsUWEVI1THFW7B6Th7W8Z23Y9cFcHKJEcDzLaVbWIvKYWU04lWtgha79DDI6qxuvZdaIOiq33dgcXGjduWtgrSeC5pdFPCitJ4doxl1fX0n3/86SdbWUhhAJtrGbKkW1jNjhXYh17vPXikLO6ZRJjOeQ+X0mOr9Dsr5Ryo+W9PRsP9cWm518CYT2/A1PRGOwcgrZ33AXjXMFswZTb0X5wSwchovSsW7bHWX+7vqbtHQLBoOlLuyU84u+sVzvMaYuQbAmgjtwqreMrXIHe8Wx1Nj10DKEEtZm0ginSTxxn8wlzcvEKgCuQI8FaTtnBr0444QARxvBcPV4aBWWyfRqw9yxpT40ibVnRRz9QL4ZJHFuXTGcBeLsmO2bbKNdSzTbrKXR/J8uPbxCByk+i1Gg6F1/EKc2ckUoHfIeHN9P0JrcIEy9oMzWitRGvtBWBdzIpQAxYjivd5QKCFCFcLvBStmbB+GqBIYpBZgeNM5Gu/vF1V9JA+oiWmXstJ3LbJi3HaFLGGgfJq2jQ50tE7igpCeux80xjYbBqSh9bfycAtnG9GWKM5EX2r7t4bZ9rR5+I/ByWwZMeDoaqq08fXGDugGhII2dZkDCf3v+qXIKIleGqtF9EYYbwW+EKvacBJf4l93UgKwKBxxp1BQlKmOfdX0+nXarjLkQ== jaimeaznar@Jaimes-MacBook-Pro-2.local"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "dev-vm-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "dev-opella-rg"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dev-opella-rg"
      + tags     = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "OpellaDevOpsChallenge"
        }
    }

  # azurerm_storage_account.storage will be created
  + resource "azurerm_storage_account" "storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "dev-opella-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "OpellaDevOpsChallenge"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days                     = (known after apply)
              + permanent_delete_enabled = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }

      + static_website {
          + error_404_document = (known after apply)
          + index_document     = (known after apply)
        }
    }

  # azurerm_storage_container.container will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "data"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = (known after apply)
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vnet.azurerm_network_security_group.nsg["app"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "app-nsg"
      + resource_group_name = "dev-opella-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSSH"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTP"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "OpellaDevOpsChallenge"
        }
    }

  # module.vnet.azurerm_network_security_group.nsg["data"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "data-nsg"
      + resource_group_name = "dev-opella-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSSH"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTP"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "OpellaDevOpsChallenge"
        }
    }

  # module.vnet.azurerm_subnet.subnet["app"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-opella-rg"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "dev-vnet"
    }

  # module.vnet.azurerm_subnet.subnet["data"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "data"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-opella-rg"
      + service_endpoints                              = [
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "dev-vnet"
    }

  # module.vnet.azurerm_subnet_network_security_group_association.nsg_association["app"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet.azurerm_subnet_network_security_group_association.nsg_association["data"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-vnet"
      + resource_group_name = "dev-opella-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "OpellaDevOpsChallenge"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + resource_group_name                   = "dev-opella-rg"
  + storage_account_name                  = (known after apply)
  + storage_account_primary_blob_endpoint = (known after apply)
  + subnet_ids                            = {
      + app  = (known after apply)
      + data = (known after apply)
    }
  + vm_id                                 = (known after apply)
  + vm_private_ip                         = (known after apply)
  + vnet_id                               = (known after apply)
  + vnet_name                             = "dev-vnet"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_linux_virtual_machine.vm will be created%0A  + resource "azurerm_linux_virtual_machine" "vm" {%0A      + admin_username                                         = "adminuser"%0A      + allow_extension_operations                             = true%0A      + bypass_platform_safety_checks_on_user_schedule_enabled = false%0A      + computer_name                                          = (known after apply)%0A      + disable_password_authentication                        = true%0A      + disk_controller_type                                   = (known after apply)%0A      + extensions_time_budget                                 = "PT1H30M"%0A      + id                                                     = (known after apply)%0A      + location                                               = "eastus"%0A      + max_bid_price                                          = -1%0A      + name                                                   = "dev-vm"%0A      + network_interface_ids                                  = (known after apply)%0A      + patch_assessment_mode                                  = "ImageDefault"%0A      + patch_mode                                             = "ImageDefault"%0A      + platform_fault_domain                                  = -1%0A      + priority                                               = "Regular"%0A      + private_ip_address                                     = (known after apply)%0A      + private_ip_addresses                                   = (known after apply)%0A      + provision_vm_agent                                     = true%0A      + public_ip_address                                      = (known after apply)%0A      + public_ip_addresses                                    = (known after apply)%0A      + resource_group_name                                    = "dev-opella-rg"%0A      + size                                                   = "Standard_B1s"%0A      + tags                                                   = {%0A          + "CostCenter"  = "Engineering"%0A          + "Environment" = "Development"%0A          + "ManagedBy"   = "Terraform"%0A          + "Project"     = "OpellaDevOpsChallenge"%0A        }%0A      + virtual_machine_id                                     = (known after apply)%0A      + vm_agent_platform_updates_enabled                      = false%0A%0A      + admin_ssh_key {%0A          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCm64OpBQgES5jsUWEVI1THFW7B6Th7W8Z23Y9cFcHKJEcDzLaVbWIvKYWU04lWtgha79DDI6qxuvZdaIOiq33dgcXGjduWtgrSeC5pdFPCitJ4doxl1fX0n3/86SdbWUhhAJtrGbKkW1jNjhXYh17vPXikLO6ZRJjOeQ+X0mOr9Dsr5Ryo+W9PRsP9cWm518CYT2/A1PRGOwcgrZ33AXjXMFswZTb0X5wSwchovSsW7bHWX+7vqbtHQLBoOlLuyU84u+sVzvMaYuQbAmgjtwqreMrXIHe8Wx1Nj10DKEEtZm0ginSTxxn8wlzcvEKgCuQI8FaTtnBr0444QARxvBcPV4aBWWyfRqw9yxpT40ibVnRRz9QL4ZJHFuXTGcBeLsmO2bbKNdSzTbrKXR/J8uPbxCByk+i1Gg6F1/EKc2ckUoHfIeHN9P0JrcIEy9oMzWitRGvtBWBdzIpQAxYjivd5QKCFCFcLvBStmbB+GqBIYpBZgeNM5Gu/vF1V9JA+oiWmXstJ3LbJi3HaFLGGgfJq2jQ50tE7igpCeux80xjYbBqSh9bfycAtnG9GWKM5EX2r7t4bZ9rR5+I/ByWwZMeDoaqq08fXGDugGhII2dZkDCf3v+qXIKIleGqtF9EYYbwW+EKvacBJf4l93UgKwKBxxp1BQlKmOfdX0+nXarjLkQ== jaimeaznar@Jaimes-MacBook-Pro-2.local"%0A          + username   = "adminuser"%0A        }%0A%0A      + os_disk {%0A          + caching                   = "ReadWrite"%0A          + disk_size_gb              = (known after apply)%0A          + name                      = (known after apply)%0A          + storage_account_type      = "Standard_LRS"%0A          + write_accelerator_enabled = false%0A        }%0A%0A      + source_image_reference {%0A          + offer     = "UbuntuServer"%0A          + publisher = "Canonical"%0A          + sku       = "18.04-LTS"%0A          + version   = "latest"%0A        }%0A%0A      + termination_notification {%0A          + enabled = (known after apply)%0A          + timeout = (known after apply)%0A        }%0A    }%0A%0A  # azurerm_network_interface.vm_nic will be created%0A  + resource "azurerm_network_interface" "vm_nic" {%0A      + accelerated_networking_enabled = (known after apply)%0A      + applied_dns_servers            = (known after apply)%0A      + dns_servers                    = (known after apply)%0A      + enable_accelerated_networking  = (known after apply)%0A      + enable_ip_forwarding           = (known after apply)%0A      + id                             = (known after apply)%0A      + internal_domain_name_suffix    = (known after apply)%0A      + ip_forwarding_enabled          = (known after apply)%0A      + location                       = "eastus"%0A      + mac_address                    = (known after apply)%0A      + name                           = "dev-vm-nic"%0A      + private_ip_address             = (known after apply)%0A      + private_ip_addresses           = (known after apply)%0A      + resource_group_name            = "dev-opella-rg"%0A      + virtual_machine_id             = (known after apply)%0A%0A      + ip_configuration {%0A          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)%0A          + name                                               = "internal"%0A          + primary                                            = (known after apply)%0A          + private_ip_address                                 = (known after apply)%0A          + private_ip_address_allocation                      = "Dynamic"%0A          + private_ip_address_version                         = "IPv4"%0A          + subnet_id                                          = (known after apply)%0A        }%0A    }%0A%0A  # azurerm_resource_group.rg will be created%0A  + resource "azurerm_resource_group" "rg" {%0A      + id       = (known after apply)%0A      + location = "eastus"%0A      + name     = "dev-opella-rg"%0A      + tags     = {%0A          + "CostCenter"  = "Engineering"%0A          + "Environment" = "Development"%0A          + "ManagedBy"   = "Terraform"%0A          + "Project"     = "OpellaDevOpsChallenge"%0A        }%0A    }%0A%0A  # azurerm_storage_account.storage will be created%0A  + resource "azurerm_storage_account" "storage" {%0A      + access_tier                        = (known after apply)%0A      + account_kind                       = "StorageV2"%0A      + account_replication_type           = "LRS"%0A      + account_tier                       = "Standard"%0A      + allow_nested_items_to_be_public    = true%0A      + cross_tenant_replication_enabled   = true%0A      + default_to_oauth_authentication    = false%0A      + dns_endpoint_type                  = "Standard"%0A      + enable_https_traffic_only          = (known after apply)%0A      + https_traffic_only_enabled         = (known after apply)%0A      + id                                 = (known after apply)%0A      + infrastructure_encryption_enabled  = false%0A      + is_hns_enabled                     = false%0A      + large_file_share_enabled           = (known after apply)%0A      + local_user_enabled                 = true%0A      + location                           = "eastus"%0A      + min_tls_version                    = "TLS1_2"%0A      + name                               = (known after apply)%0A      + nfsv3_enabled                      = false%0A      + primary_access_key                 = (sensitive value)%0A      + primary_blob_connection_string     = (sensitive value)%0A      + primary_blob_endpoint              = (known after apply)%0A      + primary_blob_host                  = (known after apply)%0A      + primary_blob_internet_endpoint     = (known after apply)%0A      + primary_blob_internet_host         = (known after apply)%0A      + primary_blob_microsoft_endpoint    = (known after apply)%0A      + primary_blob_microsoft_host        = (known after apply)%0A      + primary_connection_string          = (sensitive value)%0A      + primary_dfs_endpoint               = (known after apply)%0A      + primary_dfs_host                   = (known after apply)%0A      + primary_dfs_internet_endpoint      = (known after apply)%0A      + primary_dfs_internet_host          = (known after apply)%0A      + primary_dfs_microsoft_endpoint     = (known after apply)%0A      + primary_dfs_microsoft_host         = (known after apply)%0A      + primary_file_endpoint              = (known after apply)%0A      + primary_file_host                  = (known after apply)%0A      + primary_file_internet_endpoint     = (known after apply)%0A      + primary_file_internet_host         = (known after apply)%0A      + primary_file_microsoft_endpoint    = (known after apply)%0A      + primary_file_microsoft_host        = (known after apply)%0A      + primary_location                   = (known after apply)%0A      + primary_queue_endpoint             = (known after apply)%0A      + primary_queue_host                 = (known after apply)%0A      + primary_queue_microsoft_endpoint   = (known after apply)%0A      + primary_queue_microsoft_host       = (known after apply)%0A      + primary_table_endpoint             = (known after apply)%0A      + primary_table_host                 = (known after apply)%0A      + primary_table_microsoft_endpoint   = (known after apply)%0A      + primary_table_microsoft_host       = (known after apply)%0A      + primary_web_endpoint               = (known after apply)%0A      + primary_web_host                   = (known after apply)%0A      + primary_web_internet_endpoint      = (known after apply)%0A      + primary_web_internet_host          = (known after apply)%0A      + primary_web_microsoft_endpoint     = (known after apply)%0A      + primary_web_microsoft_host         = (known after apply)%0A      + public_network_access_enabled      = true%0A      + queue_encryption_key_type          = "Service"%0A      + resource_group_name                = "dev-opella-rg"%0A      + secondary_access_key               = (sensitive value)%0A      + secondary_blob_connection_string   = (sensitive value)%0A      + secondary_blob_endpoint            = (known after apply)%0A      + secondary_blob_host                = (known after apply)%0A      + secondary_blob_internet_endpoint   = (known after apply)%0A      + secondary_blob_internet_host       = (known after apply)%0A      + secondary_blob_microsoft_endpoint  = (known after apply)%0A      + secondary_blob_microsoft_host      = (known after apply)%0A      + secondary_connection_string        = (sensitive value)%0A      + secondary_dfs_endpoint             = (known after apply)%0A      + secondary_dfs_host                 = (known after apply)%0A      + secondary_dfs_internet_endpoint    = (known after apply)%0A      + secondary_dfs_internet_host        = (known after apply)%0A      + secondary_dfs_microsoft_endpoint   = (known after apply)%0A      + secondary_dfs_microsoft_host       = (known after apply)%0A      + secondary_file_endpoint            = (known after apply)%0A      + secondary_file_host                = (known after apply)%0A      + secondary_file_internet_endpoint   = (known after apply)%0A      + secondary_file_internet_host       = (known after apply)%0A      + secondary_file_microsoft_endpoint  = (known after apply)%0A      + secondary_file_microsoft_host      = (known after apply)%0A      + secondary_location                 = (known after apply)%0A      + secondary_queue_endpoint           = (known after apply)%0A      + secondary_queue_host               = (known after apply)%0A      + secondary_queue_microsoft_endpoint = (known after apply)%0A      + secondary_queue_microsoft_host     = (known after apply)%0A      + secondary_table_endpoint           = (known after apply)%0A      + secondary_table_host               = (known after apply)%0A      + secondary_table_microsoft_endpoint = (known after apply)%0A      + secondary_table_microsoft_host     = (known after apply)%0A      + secondary_web_endpoint             = (known after apply)%0A      + secondary_web_host                 = (known after apply)%0A      + secondary_web_internet_endpoint    = (known after apply)%0A      + secondary_web_internet_host        = (known after apply)%0A      + secondary_web_microsoft_endpoint   = (known after apply)%0A      + secondary_web_microsoft_host       = (known after apply)%0A      + sftp_enabled                       = false%0A      + shared_access_key_enabled          = true%0A      + table_encryption_key_type          = "Service"%0A      + tags                               = {%0A          + "CostCenter"  = "Engineering"%0A          + "Environment" = "Development"%0A          + "ManagedBy"   = "Terraform"%0A          + "Project"     = "OpellaDevOpsChallenge"%0A        }%0A%0A      + blob_properties {%0A          + change_feed_enabled           = (known after apply)%0A          + change_feed_retention_in_days = (known after apply)%0A          + default_service_version       = (known after apply)%0A          + last_access_time_enabled      = (known after apply)%0A          + versioning_enabled            = (known after apply)%0A%0A          + container_delete_retention_policy {%0A              + days = (known after apply)%0A            }%0A%0A          + cors_rule {%0A              + allowed_headers    = (known after apply)%0A              + allowed_methods    = (known after apply)%0A              + allowed_origins    = (known after apply)%0A              + exposed_headers    = (known after apply)%0A              + max_age_in_seconds = (known after apply)%0A            }%0A%0A          + delete_retention_policy {%0A              + days                     = (known after apply)%0A              + permanent_delete_enabled = (known after apply)%0A            }%0A%0A          + restore_policy {%0A              + days = (known after apply)%0A            }%0A        }%0A%0A      + network_rules {%0A          + bypass                     = [%0A              + "AzureServices",%0A            ]%0A          + default_action             = "Allow"%0A          + ip_rules                   = (known after apply)%0A          + virtual_network_subnet_ids = (known after apply)%0A        }%0A%0A      + queue_properties {%0A          + cors_rule {%0A              + allowed_headers    = (known after apply)%0A              + allowed_methods    = (known after apply)%0A              + allowed_origins    = (known after apply)%0A              + exposed_headers    = (known after apply)%0A              + max_age_in_seconds = (known after apply)%0A            }%0A%0A          + hour_metrics {%0A              + enabled               = (known after apply)%0A              + include_apis          = (known after apply)%0A              + retention_policy_days = (known after apply)%0A              + version               = (known after apply)%0A            }%0A%0A          + logging {%0A              + delete                = (known after apply)%0A              + read                  = (known after apply)%0A              + retention_policy_days = (known after apply)%0A              + version               = (known after apply)%0A              + write                 = (known after apply)%0A            }%0A%0A          + minute_metrics {%0A              + enabled               = (known after apply)%0A              + include_apis          = (known after apply)%0A              + retention_policy_days = (known after apply)%0A              + version               = (known after apply)%0A            }%0A        }%0A%0A      + routing {%0A          + choice                      = (known after apply)%0A          + publish_internet_endpoints  = (known after apply)%0A          + publish_microsoft_endpoints = (known after apply)%0A        }%0A%0A      + share_properties {%0A          + cors_rule {%0A              + allowed_headers    = (known after apply)%0A              + allowed_methods    = (known after apply)%0A              + allowed_origins    = (known after apply)%0A              + exposed_headers    = (known after apply)%0A              + max_age_in_seconds = (known after apply)%0A            }%0A%0A          + retention_policy {%0A              + days = (known after apply)%0A            }%0A%0A          + smb {%0A              + authentication_types            = (known after apply)%0A              + channel_encryption_type         = (known after apply)%0A              + kerberos_ticket_encryption_type = (known after apply)%0A              + multichannel_enabled            = (known after apply)%0A              + versions                        = (known after apply)%0A            }%0A        }%0A%0A      + static_website {%0A          + error_404_document = (known after apply)%0A          + index_document     = (known after apply)%0A        }%0A    }%0A%0A  # azurerm_storage_container.container will be created%0A  + resource "azurerm_storage_container" "container" {%0A      + container_access_type             = "private"%0A      + default_encryption_scope          = (known after apply)%0A      + encryption_scope_override_enabled = true%0A      + has_immutability_policy           = (known after apply)%0A      + has_legal_hold                    = (known after apply)%0A      + id                                = (known after apply)%0A      + metadata                          = (known after apply)%0A      + name                              = "data"%0A      + resource_manager_id               = (known after apply)%0A      + storage_account_name              = (known after apply)%0A    }%0A%0A  # random_string.suffix will be created%0A  + resource "random_string" "suffix" {%0A      + id          = (known after apply)%0A      + length      = 8%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (known after apply)%0A      + special     = false%0A      + upper       = false%0A    }%0A%0A  # module.vnet.azurerm_network_security_group.nsg["app"] will be created%0A  + resource "azurerm_network_security_group" "nsg" {%0A      + id                  = (known after apply)%0A      + location            = "eastus"%0A      + name                = "app-nsg"%0A      + resource_group_name = "dev-opella-rg"%0A      + security_rule       = [%0A          + {%0A              + access                                     = "Allow"%0A              + description                                = ""%0A              + destination_address_prefix                 = "*"%0A              + destination_address_prefixes               = []%0A              + destination_application_security_group_ids = []%0A              + destination_port_range                     = "22"%0A              + destination_port_ranges                    = []%0A              + direction                                  = "Inbound"%0A              + name                                       = "AllowSSH"%0A              + priority                                   = 110%0A              + protocol                                   = "Tcp"%0A              + source_address_prefix                      = "*"%0A              + source_address_prefixes                    = []%0A              + source_application_security_group_ids      = []%0A              + source_port_range                          = "*"%0A              + source_port_ranges                         = []%0A            },%0A          + {%0A              + access                                     = "Allow"%0A              + description                                = ""%0A              + destination_address_prefix                 = "*"%0A              + destination_address_prefixes               = []%0A              + destination_application_security_group_ids = []%0A              + destination_port_range                     = "80"%0A              + destination_port_ranges                    = []%0A              + direction                                  = "Inbound"%0A              + name                                       = "AllowHTTP"%0A              + priority                                   = 100%0A              + protocol                                   = "Tcp"%0A              + source_address_prefix                      = "*"%0A              + source_address_prefixes                    = []%0A              + source_application_security_group_ids      = []%0A              + source_port_range                          = "*"%0A              + source_port_ranges                         = []%0A            },%0A        ]%0A      + tags                = {%0A          + "CostCenter"  = "Engineering"%0A          + "Environment" = "Development"%0A          + "ManagedBy"   = "Terraform"%0A          + "Project"     = "OpellaDevOpsChallenge"%0A        }%0A    }%0A%0A  # module.vnet.azurerm_network_security_group.nsg["data"] will be created%0A  + resource "azurerm_network_security_group" "nsg" {%0A      + id                  = (known after apply)%0A      + location            = "eastus"%0A      + name                = "data-nsg"%0A      + resource_group_name = "dev-opella-rg"%0A      + security_rule       = [%0A          + {%0A              + access                                     = "Allow"%0A              + description                                = ""%0A              + destination_address_prefix                 = "*"%0A              + destination_address_prefixes               = []%0A              + destination_application_security_group_ids = []%0A              + destination_port_range                     = "22"%0A              + destination_port_ranges                    = []%0A              + direction                                  = "Inbound"%0A              + name                                       = "AllowSSH"%0A              + priority                                   = 110%0A              + protocol                                   = "Tcp"%0A              + source_address_prefix                      = "*"%0A              + source_address_prefixes                    = []%0A              + source_application_security_group_ids      = []%0A              + source_port_range                          = "*"%0A              + source_port_ranges                         = []%0A            },%0A          + {%0A              + access                                     = "Allow"%0A              + description                                = ""%0A              + destination_address_prefix                 = "*"%0A              + destination_address_prefixes               = []%0A              + destination_application_security_group_ids = []%0A              + destination_port_range                     = "80"%0A              + destination_port_ranges                    = []%0A              + direction                                  = "Inbound"%0A              + name                                       = "AllowHTTP"%0A              + priority                                   = 100%0A              + protocol                                   = "Tcp"%0A              + source_address_prefix                      = "*"%0A              + source_address_prefixes                    = []%0A              + source_application_security_group_ids      = []%0A              + source_port_range                          = "*"%0A              + source_port_ranges                         = []%0A            },%0A        ]%0A      + tags                = {%0A          + "CostCenter"  = "Engineering"%0A          + "Environment" = "Development"%0A          + "ManagedBy"   = "Terraform"%0A          + "Project"     = "OpellaDevOpsChallenge"%0A        }%0A    }%0A%0A  # module.vnet.azurerm_subnet.subnet["app"] will be created%0A  + resource "azurerm_subnet" "subnet" {%0A      + address_prefixes                               = [%0A          + "10.0.1.0/24",%0A        ]%0A      + default_outbound_access_enabled                = true%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "app"%0A      + private_endpoint_network_policies              = (known after apply)%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = "dev-opella-rg"%0A      + service_endpoints                              = [%0A          + "Microsoft.Storage",%0A        ]%0A      + virtual_network_name                           = "dev-vnet"%0A    }%0A%0A  # module.vnet.azurerm_subnet.subnet["data"] will be created%0A  + resource "azurerm_subnet" "subnet" {%0A      + address_prefixes                               = [%0A          + "10.0.2.0/24",%0A        ]%0A      + default_outbound_access_enabled                = true%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "data"%0A      + private_endpoint_network_policies              = (known after apply)%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = "dev-opella-rg"%0A      + service_endpoints                              = [%0A          + "Microsoft.Sql",%0A          + "Microsoft.Storage",%0A        ]%0A      + virtual_network_name                           = "dev-vnet"%0A    }%0A%0A  # module.vnet.azurerm_subnet_network_security_group_association.nsg_association["app"] will be created%0A  + resource "azurerm_subnet_network_security_group_association" "nsg_association" {%0A      + id                        = (known after apply)%0A      + network_security_group_id = (known after apply)%0A      + subnet_id                 = (known after apply)%0A    }%0A%0A  # module.vnet.azurerm_subnet_network_security_group_association.nsg_association["data"] will be created%0A  + resource "azurerm_subnet_network_security_group_association" "nsg_association" {%0A      + id                        = (known after apply)%0A      + network_security_group_id = (known after apply)%0A      + subnet_id                 = (known after apply)%0A    }%0A%0A  # module.vnet.azurerm_virtual_network.vnet will be created%0A  + resource "azurerm_virtual_network" "vnet" {%0A      + address_space       = [%0A          + "10.0.0.0/16",%0A        ]%0A      + dns_servers         = []%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "eastus"%0A      + name                = "dev-vnet"%0A      + resource_group_name = "dev-opella-rg"%0A      + subnet              = (known after apply)%0A      + tags                = {%0A          + "CostCenter"  = "Engineering"%0A          + "Environment" = "Development"%0A          + "ManagedBy"   = "Terraform"%0A          + "Project"     = "OpellaDevOpsChallenge"%0A        }%0A    }%0A%0APlan: 13 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + resource_group_name                   = "dev-opella-rg"%0A  + storage_account_name                  = (known after apply)%0A  + storage_account_primary_blob_endpoint = (known after apply)%0A  + subnet_ids                            = {%0A      + app  = (known after apply)%0A      + data = (known after apply)%0A    }%0A  + vm_id                                 = (known after apply)%0A  + vm_private_ip                         = (known after apply)%0A  + vnet_id                               = (known after apply)%0A  + vnet_name                             = "dev-vnet"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pushed by: @jaimeaznar, Action: `pull_request`*